In [21]:
#read CSV files
import pandas as pd
df=pd.read_csv('Studentdetails.csv')
df

   S.No StudentName Branch        Course
0  43.0       Ziaur    CSD  Data Science
1  47.0       Afroz     IT          Java
2  22.0    Chandana    NaN         Cloud
3   NaN      Manasa    CSE           NaN
4  55.0         NaN    CSD          Html
5   NaN     Sujitha     IT        Python
6   1.0       Anees    NaN        DevOps
7  36.0    Abhinaya    CSE          Java
8  24.0   Yashwanth    CSD           NaN
9  26.0         NaN     IT        DevOps

In [36]:
#manipulate data frames
data=df.to_csv('Studentdetails.csv', index=False)
print(data)

None

In [24]:
#removing duplicate data
df.drop(axis=0, index=8)
data_drop = df.drop_duplicates(subset=['Course'])
print(data_drop)

   S.No StudentName Branch        Course
0  43.0       Ziaur    CSD  Data Science
1  47.0       Afroz     IT          Java
2  22.0    Chandana    NaN         Cloud
3   NaN      Manasa    CSE           NaN
4  55.0         NaN    CSD          Html
5   NaN     Sujitha     IT        Python
6   1.0       Anees    NaN        DevOps

In [27]:
#data manipulation operations- filtering
filter_df = df[df['Branch'] == 'IT']
print(filter_df)

   S.No StudentName Branch  Course
1  47.0       Afroz     IT    Java
5   NaN     Sujitha     IT  Python
9  26.0         NaN     IT  DevOps

In [29]:
#data manipulation operations- sorting
df = df.sort_values(by='Branch')
print(df)

   S.No StudentName Branch        Course
0  43.0       Ziaur    CSD  Data Science
4  55.0         NaN    CSD          Html
8  24.0   Yashwanth    CSD           NaN
3   NaN      Manasa    CSE           NaN
7  36.0    Abhinaya    CSE          Java
1  47.0       Afroz     IT          Java
5   NaN     Sujitha     IT        Python
9  26.0         NaN     IT        DevOps
2  22.0    Chandana    NaN         Cloud
6   1.0       Anees    NaN        DevOps

In [32]:
#data manipulation operations- grouping
group_data = df.groupby('Branch')
result = grouped_data.count()
print(result)

        S.No  StudentName  Course
Branch
CSD        3            2       2
CSE        1            2       1
IT         2            2       3